In [1]:
import pandas as pd
import numpy as np
import requests
import os
from dotenv import load_dotenv
from progressbar import ProgressBar

In [2]:
load_dotenv()
# environment variables

api_key = os.getenv('qwi_key')
# get api_key without revealing it to the public

pbar = ProgressBar()
# create progress bar for the loop

In [3]:
# Construct function to make api call for qwi
def get_qwi(state = '24', key = api_key, the_vars = ['Emp', 'TurnOvrS', 'EarnBeg']):
    HOST = 'http://api.census.gov/data/timeseries/qwi/sa?'
    get_vars = the_vars
    predicates = {}
    predicates['get'] = ",".join(get_vars)
    predicates['for'] = 'county:*'
    predicates['in'] = 'state:' + state
    predicates['sex'] = '0'
    predicates['agegrp'] = 'A00'
    predicates['industry'] = '6244'
    predicates['ownercode'] = 'A00'
    predicates['time'] = 'from 2001-Q1 to 2007-Q4'
    predicates['seasonadj'] = 'U'
    predicates['key'] = f'{key}'
    r = requests.get(HOST, params = predicates)
    df = pd.DataFrame(data = r.json()[1:])
    return df # columns = r.json()[0],

In [4]:
candidates = [str(i).zfill(2) for i in range(1,57)] # create range of state fips code
not_states = ['03', '07', '11', '14', '25', '43', '52'] # massachussets is not in qwi --> 25
filter_set = set(not_states)
states = [x for x in candidates if x not in filter_set] # state fips set
col_names = ['emp', 'turn_overs', 'earn_beg', 'sex', 'age_group', 'industry', 'owner_code','quarter', 'season_adj', 'state', 'county']

In [5]:
def create_qwi_df(states = states, col_names = col_names):
    appended_data = []
    for st in pbar(states):
        df = get_qwi(state = st)
        appended_data.append(df)
    data = pd.concat(appended_data)
    data.columns = col_names      
    return data

In [6]:
data = create_qwi_df()

100% |########################################################################|

In [7]:
print(data['state'].unique())

['01' '02' '04' '05' '06' '08' '09' '10' '12' '13' '15' '16' '17' '18'
 '19' '20' '21' '22' '23' '24' '26' '27' '28' '29' '30' '31' '32' '33'
 '34' '35' '36' '37' '38' '39' '40' '41' '42' '44' '45' '46' '47' '48'
 '49' '50' '51' '53' '54' '55' '56']

In [8]:
print(len(data['state'].unique()))

49

In [9]:
data.head()

,emp,turn_overs,earn_beg,sex,age_group,industry,owner_code,quarter,season_adj,state,county
0,None,None,None,0,A00,6244,A00,2001-Q1,U,01,001
1,103,None,1145,0,A00,6244,A00,2001-Q2,U,01,001
2,114,0.128,997,0,A00,6244,A00,2001-Q3,U,01,001
3,107,0.133,1159,0,A00,6244,A00,2001-Q4,U,01,001
4,113,0.133,1129,0,A00,6244,A00,2002-Q1,U,01,001

In [10]:
# keep columns
keep_list = ['state', 'county', 'quarter', 'emp', 'turn_overs', 'earn_beg']
data = data[keep_list]

In [11]:
data.head()

  state county  quarter   emp turn_overs earn_beg
0    01    001  2001-Q1  None       None     None
1    01    001  2001-Q2   103       None     1145
2    01    001  2001-Q3   114      0.128      997
3    01    001  2001-Q4   107      0.133     1159
4    01    001  2002-Q1   113      0.133     1129

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 77808 entries, 0 to 643
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       77808 non-null  object
 1   county      77808 non-null  object
 2   quarter     77808 non-null  object
 3   emp         58717 non-null  object
 4   turn_overs  44090 non-null  object
 5   earn_beg    76824 non-null  object
dtypes: object(6)
memory usage: 4.2+ MB

In [13]:
data = data.fillna(value=np.nan)

In [14]:
data.head()

  state county  quarter  emp turn_overs earn_beg
0    01    001  2001-Q1  NaN        NaN      NaN
1    01    001  2001-Q2  103        NaN     1145
2    01    001  2001-Q3  114      0.128      997
3    01    001  2001-Q4  107      0.133     1159
4    01    001  2002-Q1  113      0.133     1129

In [15]:
data.to_csv('../data/working/qwi_all_states_county.csv')